index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Python metaclasses &amp; descriptors</title>
<meta name="author" content="(Alex Peitsinis)"/>
<link rel="stylesheet" href="./static/reveal.js/css/reveal.css"/>

<link rel="stylesheet" href="./static/reveal.js/css/theme/beige.css" id="theme"/>

<link rel="stylesheet" href="./static/custom.css"/>
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/highlight.js/9.12.0/styles/solarized-light.min.css"/>
<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h1>Python metaclasses &amp; descriptors</h1><br><h3>Athens&nbsp;Python&nbsp;users&nbsp;meetup</h3>
</section>

<section>
<section id="slide-orge98e31a">
<h2 id="orge98e31a">Metaclasses</h2>
<div class="outline-text-2" id="text-orge98e31a">
</div></section>
<section id="slide-org902ad90">
<h3 id="org902ad90">type</h3>
<div class="org-src-container">

<pre><code class="python" >class MyClass(object):
    pass

MyClass            # __main__.MyClass
MyClass.__class__  # type
type(MyClass())    # __main__.MyClass
type(MyClass)      # type
type(object)       # type
type(type)         # type
</code></pre>
</div>

</section>
<section >

<div class="org-src-container">

<pre><code class="python" >>>> print(type.__doc__)
type(object_or_name, bases, dict)
type(object) -> the object's type
type(name, bases, dict) -> a new type
</code></pre>
</div>

</section>
<section >

<div class="org-src-container">

<pre><code class="python" >#      class     parent     class
#      name      classes    __dict__
type( 'MyClass',     (),        {}     )  # returns __main__.MyClass
</code></pre>
</div>

</section>
<section >

<div class="org-src-container">

<pre><code class="python" >Klass = type('Klass', (), {})
</code></pre>
</div>

<div class="org-src-container">

<pre><code class="python" >class Klass(object):
    pass
</code></pre>
</div>

</section>
<section >

<div class="org-src-container">

<pre><code class="python" >Klass2 = type('Klass2', (Klass, ), {})
</code></pre>
</div>

<div class="org-src-container">

<pre><code class="python" >class Klass2(Klass):
    pass
</code></pre>
</div>

</section>
<section >

<div class="org-src-container">

<pre><code class="python" >Klass3 = type('Klass3', (Klass, Klass2), {'a': 42})
</code></pre>
</div>

<div class="org-src-container">

<pre><code class="python" >class Klass3(Klass, Klass2):
    a = 42
</code></pre>
</div>

</section>
<section >

<div class="org-src-container">

<pre><code class="python" >Klass4 = type(
  'Klass4',
  (),
  {'a': 42, 'method': lambda self, num: self.a + num}
)
</code></pre>
</div>

<div class="org-src-container">

<pre><code class="python" >class Klass4(object):
    a = 42
    def method(self, x):
        return self.a + x
</code></pre>
</div>


</section>
<section id="slide-orgc868b86">
<h3 id="orgc868b86">Metaclass API</h3>
<div class="org-src-container">

<pre><code class="python" >Metaclass.__prepare__(mcls, name, bases)  # classmethod
Metaclass.__new__(mcls, name, bases, attrs, **kwargs)
Metaclass.__init__(cls, name, bases, attrs, **kwargs)
Metaclass.__call__(cls, *args, **kwargs)
</code></pre>
</div>


</section>
<section id="slide-org3e1626c">
<h3 id="org3e1626c"><code>__prepare__</code></h3>
<ul>
<li>returns dict-like object (empty or not)</li>
<li>if not dict, must be converted to dict before <code>__new__</code> returns</li>

</ul>

</section>
<section id="slide-org6c7bc61">
<h4 id="org6c7bc61">Example: Allow only uppercase attribute names</h4>
<div class="org-src-container">

<pre><code class="python" >class OnlyUppercase(dict):
    def __setitem__(self, key, value):
        if isinstance(key, str) and key.isupper():
            super().__setitem__(key, value)

class MyMeta(type):
    @classmethod
    def __prepare__(mcls, name, bases):
        return OnlyUppercase()

    def __new__(mcls, name, bases, attrs):
        return super().__new__(mcls, name, bases, dict(attrs))

class MyClass(metaclass=MyMeta):
    lowercase = 1
    UPPERCASE = 2

MyClass.__dict__  # {'UPPERCASE': 2}
</code></pre>
</div>


</section>
<section id="slide-org11887b3">
<h3 id="org11887b3"><code>__new__</code></h3>
<ul>
<li><b>class</b> constructor (<code>class MyClass ...</code> -&gt; <code>__new__</code> runs)</li>
<li>most useful</li>

</ul>


</section>
<section id="slide-orgfb3f017">
<h3 id="orgfb3f017"><code>__init__</code></h3>
<ul>
<li><b>class</b> initializer (after <code>__new__</code>)</li>
<li>not generally useful</li>

</ul>


</section>
<section id="slide-orga30c20e">
<h3 id="orga30c20e"><code>__call__</code></h3>
<ul>
<li><b>object</b> instantiation (before <code>Class.__new__</code> &amp; <code>object.__init__</code>)</li>

</ul>

<div class="org-src-container">

<pre><code class="python" >class MyMeta(type):
    def __call__(cls, *args, **kwargs):
        print('In metaclass', args, kwargs)
        return super().__call__(*args, **kwargs)

class MyClass(metaclass=MyMeta):
    def __init__(cls, *args, **kwargs):
        print('In class', args, kwargs)
</code></pre>
</div>

<div class="org-src-container">

<pre><code class="python" >>>> obj = MyClass(1, 2, foo=42)
In metaclass (1, 2), {'foo': 42}
In class (1, 2) {'foo': 42}
</code></pre>
</div>


</section>
<section id="slide-org7019814">
<h3 id="org7019814">Example: Call order</h3>
<div class="org-src-container">

<pre><code class="python" >class MyMeta(type):
    @classmethod
    def __prepare__(mcls, name, bases):
        print('Meta __prepare__')
        return super().__prepare__(mcls, name, bases)

    def __new__(mcls, name, bases, attrs):
        print('Meta __new__')
        return super().__new__(mcls, name, bases, attrs)

    def __init__(cls, name, bases, attrs):
        print('Meta __init__')
        return super().__init__(name, bases, attrs)

    def __call__(cls, *args, **kwargs):
        print('Meta __call__')
        return super().__call__(*args, **kwargs)
</code></pre>
</div>

</section>
<section >

<div class="org-src-container">

<pre><code class="python" >>>> class MyClass(metaclass=MyMeta):
...     def __new__(cls, *args, **kwargs):
...         print('Class __new__')
...         return super().__new__(cls)
...     def __init__(self, *args, **kwargs):
...         print('Class __init__')
...
Meta __prepare__
Meta __new__
Meta __init__
>>>
>>> obj = MyClass()
Meta __call__
Class __new__
Class __init__
</code></pre>
</div>


</section>
<section id="slide-orgd81a91d">
<h3 id="orgd81a91d">Example: singleton</h3>
<div class="org-src-container">

<pre><code class="python" >class SingletonMeta(type):

    def __call__(cls, *args, **kwargs):
        if not hasattr(cls, '_inst'):
            obj = super(SingletonMeta, cls).__call__(*args, **kwargs)
            cls._inst = obj
        return cls._inst

class MyClass(metaclass=SingletonMeta):
    pass
</code></pre>
</div>

<div class="org-src-container">

<pre><code class="python" >>>> a = MyClass()
>>> b = MyClass()
>>> a is b
True
</code></pre>
</div>


</section>
<section id="slide-orgf5ef573">
<h3 id="orgf5ef573">Example: metaclass is a callable</h3>
<div class="org-src-container">

<pre><code class="python" >>>> class MyClass(metaclass=print):
...     a = 1
...
MyClass () {'__qualname__': 'MyClass', '__module__': '__main__', 'a': 1}
>>> MyClass is None
True
</code></pre>
</div>


</section>
</section>
<section>
<section id="slide-orgcfdb8cc">
<h2 id="orgcfdb8cc">Attribute lookup</h2>
<div class="outline-text-2" id="text-orgcfdb8cc">
</div></section>
<section id="slide-orgbd4b843">
<h3 id="orgbd4b843">Object-level (instance.attr)</h3>
<ul>
<li class="fragment appear">attr in <code>Class.__dict__</code> and attr is data descriptor -&gt; <code>Class.__dict__['attr'].__get__(instance, Class)</code></li>
<li class="fragment appear">attr in <code>instance.__dict__</code> -&gt; <code>instance.__dict__['attr']</code></li>
<li class="fragment appear">attr in <code>Class.__dict__</code> <b>and</b> attr is <b>not</b> a data descriptor -&gt; <code>Class.__dict__['attr'].__get__(instance, Class)</code></li>
<li class="fragment appear">attr in <code>Class.__dict__</code> -&gt; <code>Class.__dict__['attr']</code></li>
<li class="fragment appear"><code>Class.__getattr__</code> exists -&gt; <code>Class.__getattr__('attr')</code></li>

</ul>


</section>
<section id="slide-org2150bfc">
<h3 id="org2150bfc">Class-level (Class.attr)</h3>
<ul>
<li class="fragment appear">attr in <code>Metaclass.__dict__</code> and attr is data desciptor -&gt; <code>Metaclass.__dict__['attr'].__get__(Class, Metaclass)</code></li>
<li class="fragment appear">attr in <code>Class.__dict__</code> and attr is descriptor -&gt; <code>Class.__dict__['attr'].__get__(None, Class)</code></li>
<li class="fragment appear">attr in <code>Class.__dict__</code> -&gt; <code>Class.__dict__['attr']</code></li>

</ul>


</section>
<section id="slide-org7c2d425">
<h3 id="org7c2d425">Class-level (cont.)</h3>
<ul>
<li class="fragment appear">attr in <code>Metaclass.__dict__</code> <b>and</b> attr is <b>not</b> a data descriptor -&gt; <code>Metaclass.__dict__['attr'].__get__(Class, Metaclass)</code></li>
<li class="fragment appear">attr in <code>Metaclass.__dict__</code> -&gt; <code>Metaclass.__dict__['attr']</code></li>
<li class="fragment appear"><code>Metaclass.__getattr__</code> exists -&gt; <code>Metaclass.__getattr__('attr')</code></li>

</ul>


</section>
</section>
<section>
<section id="slide-org63f505a">
<h2 id="org63f505a">Descriptors</h2>
<ul>
<li>only defined in class-level (not in <code>__init__</code> etc.)</li>
<li>objects with <code>__get__</code>, <code>__set__</code> &amp; <code>__delete__</code> methods</li>
<li><code>__get__</code> &amp; <code>__set__</code> = data descriptors</li>
<li>only <code>__get__</code> = non-data descriptors</li>
<li>e.g. <code>property</code> decorator (getter &amp; setter)</li>

</ul>

</section>
<section id="slide-org32a5b2e">
<h3 id="org32a5b2e">Descriptor API</h3>
<div class="org-src-container">

<pre><code class="python" >descr.__get__(self, obj, cls)  # -> value
descr.__set__(self, obj, value)  # -> None
descr.__delete__(self, obj)  # -> None
</code></pre>
</div>


</section>
<section id="slide-org2c8ed95">
<h3 id="org2c8ed95">Example</h3>
<div class="org-src-container">

<pre><code class="python" >class Descriptor(object):
    def __init__(self, initval=None, name='var'):
        self.val = initval
        self.name = name

    def __get__(self, obj, cls):
        print('get', self.name)
        return self.val

    def __set__(self, obj, val):
        print('set', self.name)
        self.val = val

class MyClass(object):
    attr = Descriptor(initval=10, name='attr')
</code></pre>
</div>

</section>
<section >

<div class="org-src-container">

<pre><code class="python" >>>> MyClass.attr
get attr
10
>>> MyClass.attr = 11
>>> MyClass.attr
11
>>> # oops
</code></pre>
</div>

</section>
<section >

<div class="org-src-container">

<pre><code class="ipython" >>>> a = MyClass()
>>> a.attr
get attr
10
>>> a.attr = 11
set attr
>>> a.attr
get attr
11

>>> b = MyClass()
>>> b.attr
get attr
11
>>> # wat
</code></pre>
</div>


</section>
<section id="slide-orgcc75ae5">
<h3 id="orgcc75ae5">Example</h3>
<ul>
<li>use descriptors to indirectly set values on <code>instance.__dict__</code></li>
<li>if called from class, just return the descriptor class</li>

</ul>

</section>
<section >

<div class="org-src-container">

<pre><code class="python" >class Descriptor(object):
    def __init__(self, name):
        self.name = name

    def __get__(self, obj, cls):
        if obj is None:
            return self
        try:
            print('get', self.name)
            return obj.__dict__[self.name]
        except KeyError:
            raise AttributeError()

    def __set__(self, obj, val):
        print('set', self.name)
        obj.__dict__[self.name] = val

class MyClass(object):
    attr  = Descriptor('attr')
</code></pre>
</div>

</section>
<section >

<div class="org-src-container">

<pre><code class="ipython" >>>> MyClass.attr
<__main__.Descriptor at 0x312....>
>>>
>>> a = MyClass()
>>> a.attr
get attr
Traceback (most recent call last)
....
AttributeError: ...
>>> a.attr = 1
set attr
>>> a.attr
get attr
1
>>>
>>> b = MyClass()
>>> b.attr = 2
set attr
>>> b.attr
get attr
2
>>> a.attr
get attr
1
</code></pre>
</div>


</section>
</section>
<section>
<section id="slide-orge3fbccd">
<h2 id="orge3fbccd">Metaclasses &amp; descriptors</h2>
<ul>
<li><code>attr = Descriptor('attr')</code> -&gt; <code>attr = Descriptor()</code></li>

</ul>

</section>
<section id="slide-orgc32a210">
<h3 id="orgc32a210">Example</h3>
<div class="org-src-container">

<pre><code class="python" >class Descriptor(object):
    def __init__(self):
        self.name = None

    def __get__(self, obj, cls):
        if obj is None:
            return self
        try:
            print('get', self.name)
            return obj.__dict__[self.name]
        except KeyError:
            raise AttributeError()

    def __set__(self, obj, val):
        print('set', self.name)
        obj.__dict__[self.name] = val
</code></pre>
</div>

</section>
<section >

<div class="org-src-container">

<pre><code class="python" >class MyMeta(type):
    def __new__(mcls, name, bases, attrs):
        for k, v in attrs.items():
            if isinstance(v, Descriptor):
                v.name = k
        return super().__new__(mcls, name, bases, attrs)

class MyClass(metaclass=MyMeta):
    attr  = Descriptor()
</code></pre>
</div>

</section>
<section >

<div class="org-src-container">

<pre><code class="ipython" >>>> MyClass.attr
<__main__.Descriptor at 0x312....>
>>>
>>> a = MyClass()
>>> a.attr = 1
set attr
>>> a.attr
get attr
1
>>> a.__dict__
{'attr': 1}
</code></pre>
</div>


</section>
<section id="slide-org20f5312">
<h3 id="org20f5312">Example: using annotations for typing (Python 3.6)</h3>
<div class="org-src-container">

<pre><code class="python" >>>> class MyClass:
...     a: int
...     b: str
...
>>> MyClass.__annotations__
{'a': int, 'b': str}
</code></pre>
</div>

</section>
<section >

<div class="org-src-container">

<pre><code class="python" >>>> class MyClass(Typed):
...     a: int
...     b: str
...
>>> obj = MyClass()
>>> obj.a = 1
>>> obj.a = 'foo'
...
...
TypeError: 'foo' is not of type 'int'
</code></pre>
</div>

</section>
<section >

<div class="org-src-container">

<pre><code class="python" >class TypedDescriptor:
    def __init__(self, name, tp):
        self.name = name
        self.tp = tp

    def __get__(self, obj, cls):
        if obj is None:
            return self
        try:
            return obj.__dict__[self.name]
        except KeyError:
            raise AttributeError()

    def __set__(self, obj, val):
        if not isinstance(val, self.tp):
            raise TypeError()
        obj.__dict__[self.name] = val
</code></pre>
</div>

</section>
<section >

<div class="org-src-container">

<pre><code class="python" >class TypedMeta(type):
    def __new__(mcls, name, bases, attrs):
        ann = attrs.get('__annotations__', {})
        for k, v in ann.items():
            attrs[k] = TypedDescriptor(name=k, tp=v)
        return super().__new__(mcls, name, bases, attrs)

class Typed(metaclass=TypedMeta):
    pass
</code></pre>
</div>


</section>
</section>
<section>
<section id="slide-org14a4694">
<h2 id="org14a4694">Links</h2>
<ul>
<li><a href="https://blog.ionelmc.ro/2015/02/09/understanding-python-metaclasses/">Understanding Python metaclasses</a></li>
<li><a href="https://docs.python.org/3/howto/descriptor.html">Descriptor HowTo Guide</a></li>
<li><a href="https://www.youtube.com/watch?v=sPiWg5jSoZI">Dave Beazley: Python 3 Metaprogramming</a></li>
<li><a href="https://www.python.org/dev/peps/pep-3115/">PEP 3115: Metaclasses in Python 3</a></li>
<li><a href="https://github.com/python/cpython/blob/3.6/Lib/typing.py#L2119">Python 3.6 NamedTuple class (source code)</a></li>
<li><a href="https://github.com/alexpeits/metaclasses-pythonmeetup-hsgr">Presentation git repo</a></li>

</ul>
</section>
</section>
</div>
</div>
<script src="./static/reveal.js/lib/js/head.min.js"></script>
<script src="./static/reveal.js/js/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

controls: true,
progress: true,
history: true,
center: true,
slideNumber: 'c',
rollingLinks: false,
keyboard: true,
overview: true,

theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
transition: Reveal.getQueryHash().transition || 'none', // default/cube/page/concave/zoom/linear/fade/none
transitionSpeed: 'default',
multiplex: {
    secret: '', // null if client
    id: '', // id, obtained from socket.io server
    url: '' // Location of socket.io server
},

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: './static/reveal.js/plugin/highlight/highlight.js', async: true, callback: function() { hljs.initHighlightingOnLoad(); } },
 { src: './static/reveal.js/lib/js/classList.js', condition: function() { return !document.body.classList; } },
 { src: './static/reveal.js/plugin/markdown/marked.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: './static/reveal.js/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: './static/reveal.js/plugin/zoom-js/zoom.js', async: true, condition: function() { return !!document.body.classList; } },
 { src: './static/reveal.js/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }]
});
</script>
</body>
</html>
